Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM028.atdf
         <register caption="" name="CCP7CON1" offset="0x600" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCP7CON1__TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP7CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP7CON1__SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP7CON1__OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP8CON1" offset="0x700" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCP8CON1__TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP8CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP8CON1__SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP8CON1__OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP9CON1" offset="0x800" rw="RW" size="4">
            <bitfield caption="" mask="0x0000000F" name="MOD" />
            <bitfield caption="" mask="0x00000010" name="CCSEL" />
            <bitfield caption="" mask="0x00000020" name="T32" />
            <bitfield caption="" mask="0x000000C0" name="TMRPS" values="CCP9CON1__TMRPS" />
            <bitfield caption="" mask="0x00000700" name="CLKSEL" values="CCP9CON1__CLKSEL" />
            <bitfield caption="" mask="0x00000800" name="TMRSYNC" />
            <bitfield caption="" mask="0x00001000" name="CCPSLP" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="SYNC" values="CCP9CON1__SYNC" />
            <bitfield caption="" mask="0x00200000" name="ALTSYNC" />
            <bitfield caption="" mask="0x00400000" name="ONESHOT" />
            <bitfield caption="" mask="0x00800000" name="TRIGEN" />
            <bitfield caption="" mask="0x0F000000" name="OPS" values="CCP9CON1__OPS" />
            <bitfield caption="" mask="0x40000000" name="RTRGEN" />
            <bitfield caption="" mask="0x80000000" name="OPSSRC" />
         </register>
         <register caption="" name="CCP1CON2" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP1CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP1CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP1CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP1CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x02000000" name="OCBEN" />
            <bitfield caption="" mask="0x04000000" name="OCCEN" />
            <bitfield caption="" mask="0x08000000" name="OCDEN" />
            <bitfield caption="" mask="0x10000000" name="OCEEN" />
            <bitfield caption="" mask="0x20000000" name="OCFEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP1CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP2CON2" offset="0x110" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP2CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP2CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP2CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP2CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x02000000" name="OCBEN" />
            <bitfield caption="" mask="0x04000000" name="OCCEN" />
            <bitfield caption="" mask="0x08000000" name="OCDEN" />
            <bitfield caption="" mask="0x10000000" name="OCEEN" />
            <bitfield caption="" mask="0x20000000" name="OCFEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP2CON2__OENSYNC"/>
         </register>
         <register caption="" name="CCP3CON2" offset="0x210" rw="RW" size="4">
            <bitfield caption="" mask="0x000000FF" name="ASDG" values="CCP3CON2__ASDG"/>
            <bitfield caption="" mask="0x00001000" name="SSDG" />
            <bitfield caption="" mask="0x00004000" name="ASDGM" values="CCP3CON2__ASDGM"/>
            <bitfield caption="" mask="0x00008000" name="PWMRSEN" vaues="CCP3CON2__PWMRSEN"/>
            <bitfield caption="" mask="0x00070000" name="ICS" values="CCP3CON2__ICS"/>
            <bitfield caption="" mask="0x00180000" name="AUXOUT" />
            <bitfield caption="" mask="0x00C00000" name="ICGSM" />
            <bitfield caption="" mask="0x01000000" name="OCAEN" />
            <bitfield caption="" mask="0x02000000" name="OCBEN" />
            <bitfield caption="" mask="0x04000000" name="OCCEN" />
            <bitfield caption="" mask="0x08000000" name="OCDEN" />
            <bitfield caption="" mask="0x10000000" name="OCEEN" />
            <bitfield caption="" mask="0x20000000" name="OCFEN" />
            <bitfield caption="" mask="0x80000000" name="OENSYNC" values="CCP3CON2__OENSYNC"/>
         </register>
