Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM028.atdf
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC3SEL__DS3">
         <value caption="SCCP7 OCMP compare match event" name="" value="0x7" />
         <value caption="SCCP6 OCMP compare match event" name="" value="0x6" />
         <value caption="SCCP6 OCM6 output" name="" value="0x5" />
         <value caption="UART3 RX In" name="" value="0x4" />
         <value caption="SPI3 SDO3 Out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC3 Out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC3SEL__DS4">
         <value caption="SCCP7 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP2 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="CMP3 out" name="" value="0x4" />
         <value caption="SPI3 SDI3 in" name="" value="0x3" />
         <value caption="SCCP7 OCM7A Output" name="" value="0x2" />
         <value caption="CLC4 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC4SEL__DS1">
         <value caption="MCCP3 OCM1F Output" name="" value="0x7" />
         <value caption="MCCP3 OCM1E Output" name="" value="0x6" />
         <value caption="MCCP3 OCM1D Output" name="" value="0x5" />
         <value caption="REFO1 Clock Output" name="" value="0x4" />
         <value caption="LPRC Clock" name="" value="0x3" />
         <value caption="SOSC Clock" name="" value="0x2" />
         <value caption="System Clock" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC4SEL__DS2">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="MCCP3 OCMP compare match event" name="" value="0x6" />
         <value caption="DMA channel 1 interrupt" name="" value="0x5" />
         <value caption="ADC End of Conversion" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC3 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC4SEL__DS3">
         <value caption="SCCP7 OCMP compare match event" name="" value="0x7" />
         <value caption="SCCP6 OCMP compare match event" name="" value="0x6" />
         <value caption="SCCP6 OCM2 output" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC4 Out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC4SEL__DS4">
         <value caption="SCCP7 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP3 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="CMP3 out" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="SCCP7 OCM3 Output" name="" value="0x2" />
         <value caption="CLC3 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01427" name="CMP" version="">
      <register-group name="CMP">
         <register caption="" name="CMSTAT" offset="0x0" rw="RW" size="4">
            <bitfield caption="Comparator 1 Output bit" mask="0x00000001" name="C1OUT" values="CMSTAT__C1OUT" />
            <bitfield caption="Comparator 2 Output bit" mask="0x00000002" name="C2OUT" values="CMSTAT__C2OUT" />
            <bitfield caption="Comparator 3 Output bit" mask="0x00000004" name="C3OUT" values="CMSTAT__C3OUT" />
            <bitfield caption="Comparator Reference Voltage Select (CVREFSEL)" mask="0x00000100" name="CVREFSEL" values="CMSTAT__CVREFSEL" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CMSTAT__SIDL" />
            <bitfield caption="" mask="0x00010000" name="C1EVT" />
            <bitfield caption="" mask="0x00020000" name="C2EVT" />
            <bitfield caption="" mask="0x00040000" name="C3EVT" />
         </register>
         <register caption="" name="CM1CON" offset="0x10" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Configuration" mask="0x00000003" name="CCH" values="CM1CON__CCH" />
            <bitfield caption="Comparator Positive Input Configuration" mask="0x00000010" name="CREF" values="CM1CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM1CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM1CON__COUT" />
            <bitfield caption="" mask="0x00000200" name="CEVT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM1CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM1CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM1CON__ON" />
         </register>
         <register caption="" name="CM2CON" offset="0x30" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Configuration" mask="0x00000003" name="CCH" values="CM2CON__CCH" />
            <bitfield caption="Comparator Positive Input Configuration" mask="0x00000010" name="CREF" values="CM2CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM2CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM2CON__COUT" />
            <bitfield caption="" mask="0x00000200" name="CEVT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM2CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM2CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM2CON__ON" />
         </register>
         <register caption="" name="CM3CON" offset="0x50" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Configuration" mask="0x00000003" name="CCH" values="CM3CON__CCH" />
            <bitfield caption="Comparator Positive Input Configuration" mask="0x00000010" name="CREF" values="CM3CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM3CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM3CON__COUT" />
            <bitfield caption="" mask="0x00000200" name="CEVT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM3CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM3CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM3CON__ON" />
         </register>
      </register-group>
