Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM028.atdf
      <value-group caption="Alarm Mask Configuration bits" name="RTCCON1__AMASK">
         <value caption="Every half-second" name="" value="0x0" />
         <value caption="Every second" name="" value="0x1" />
         <value caption="Every 10 seconds" name="" value="0x2" />
         <value caption="Every minute" name="" value="0x3" />
         <value caption="Every 10 minutes" name="" value="0x4" />
         <value caption="Every hour" name="" value="0x5" />
         <value caption="Once a day" name="" value="0x6" />
         <value caption="Once a week" name="" value="0x7" />
         <value caption="Once a month" name="" value="0x8" />
         <value caption="Once a year (or once every four years when configured for February 29th)" name="" value="0x9" />
         <value caption="Reserved" name="" value="0xa" />
      </value-group>
      <value-group caption="RTCC Clock Select bits" name="RTCCON2__CLKSEL">
         <value caption="RTCC uses peripheral clock" name="PBCLK" value="0x3" />
         <value caption="RTCC uses the clock on PWRLCLK pin" name="PWRLCLK" value="0x2" />
         <value caption="RTCC uses the internal 32 kHz oscillator (LPRC)" name="LPRC" value="0x1" />
         <value caption="RTCC uses the external 32.768 kHz Secondary Oscillator (SOSC)" name="SOSC" value="0x0" />
      </value-group>
      <value-group caption="RTCC Prescaler" name="RTCCON2__PS">
         <value caption="1:256" name="256" value="0x3" />
         <value caption="1:64" name="64" value="0x2" />
         <value caption="1:16" name="16" value="0x1" />
         <value caption="1:1" name="1" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01329" name="SPI" version="2">
      <register-group name="SPI">
         <register caption="SPI Control Register" name="SPI1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI1CON__SRXISEL" />
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI1CON__STXISEL" />
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI1CON__DISSDI" />
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI1CON__MSTEN" />
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI1CON__CKP" />
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI1CON__SSEN" />
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI1CON__CKE" />
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI1CON__SMP" />
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32" />
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI1CON__DISSDO" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI1CON__SIDL" />
            <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI1CON__ON" />
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI1CON__ENHBUF" />
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI1CON__SPIFE" />
            <bitfield caption="Master Clock Enable bit" mask="0x00800000" name="MCLKSEL" values="SPI1CON__MCLKSEL" />
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI1CON__FRMCNT" />
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI1CON__FRMSYPW" />
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI1CON__MSSEN" />
            <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI1CON__FRMPOL" />
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI1CON__FRMSYNC" />
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI1CON__FRMEN" />
         </register>
         <register caption="SPI Control Register" name="SPI2CON" offset="0x100" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI2CON__SRXISEL" />
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI2CON__STXISEL" />
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI2CON__DISSDI" />
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI2CON__MSTEN" />
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI2CON__CKP" />
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI2CON__SSEN" />
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI2CON__CKE" />
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI2CON__SMP" />
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI2CON__MODE32" />
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI2CON__DISSDO" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI2CON__SIDL" />
            <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI2CON__ON" />
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI2CON__ENHBUF" />
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI2CON__SPIFE" />
            <bitfield caption="Master Clock Enable bit" mask="0x00800000" name="MCLKSEL" values="SPI2CON__MCLKSEL" />
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI2CON__FRMCNT" />
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI2CON__FRMSYPW" />
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI2CON__MSSEN" />
            <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI2CON__FRMPOL" />
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI2CON__FRMSYNC" />
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI2CON__FRMEN" />
         </register>
         <register caption="SPI Control Register" name="SPI3CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI3CON__SRXISEL" />
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI3CON__STXISEL" />
            <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI3CON__DISSDI" />
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI3CON__MSTEN" />
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI3CON__CKP" />
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI3CON__SSEN" />
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI3CON__CKE" />
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI3CON__SMP" />
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI3CON__MODE32" />
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI3CON__DISSDO" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI3CON__SIDL" />
            <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI3CON__ON" />
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI3CON__ENHBUF" />
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI3CON__SPIFE" />
            <bitfield caption="Master Clock Enable bit" mask="0x00800000" name="MCLKSEL" values="SPI3CON__MCLKSEL" />
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI3CON__FRMCNT" />
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI3CON__FRMSYPW" />
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI3CON__MSSEN" />
            <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI3CON__FRMPOL" />
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI3CON__FRMSYNC" />
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI3CON__FRMEN" />
         </register>
