Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0128GPM028.atdf
         <register caption="USB Endpoint Control Register 7" name="U1EP7" offset="0x330" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP7__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP7__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP7__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP7__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP7__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 8" name="U1EP8" offset="0x340" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP8__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP8__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP8__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP8__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP8__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 9" name="U1EP9" offset="0x350" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP9__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP9__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP9__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP9__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP9__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 10" name="U1EP10" offset="0x360" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP10__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP10__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP10__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP10__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP10__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 11" name="U1EP11" offset="0x370" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP11__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP11__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP11__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP11__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP11__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 12" name="U1EP12" offset="0x380" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP12__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP12__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP12__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP12__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP12__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 13" name="U1EP13" offset="0x390" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP13__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP13__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP13__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP13__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP13__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 14" name="U1EP14" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP14__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP14__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP14__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP14__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP14__EPCONDIS" />
         </register>
         <register caption="USB Endpoint Control Register 15" name="U1EP15" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="Endpoint Handshake Enable bit" mask="0x00000001" name="EPHSHK" values="U1EP15__EPHSHK" />
            <bitfield caption="Endpoint Stall Status bit" mask="0x00000002" name="EPSTALL" values="U1EP15__EPSTALL" />
            <bitfield caption="Endpoint Transmit Enable bit" mask="0x00000004" name="EPTXEN" values="U1EP15__EPTXEN" />
            <bitfield caption="Endpoint Receive Enable bit" mask="0x00000008" name="EPRXEN" values="U1EP15__EPRXEN" />
            <bitfield caption="Bidirectional Endpoint Control bit" mask="0x00000010" name="EPCONDIS" values="U1EP15__EPCONDIS" />
         </register>
      </register-group>
      <value-group caption="A-Device" name="U1OTGIR__VBUSVDIF">
         <value caption="Change on the session valid input is detected" name="" value="0x1" />
         <value caption="No change on the session valid input is detected" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Device" name="U1OTGIR__SESENDIF">
         <value caption="A change on the session end input was detected" name="" value="0x1" />
         <value caption="No change on the session end input was detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Valid Change Indicator bit" name="U1OTGIR__SESVDIF">
         <value caption="Vbus voltage has dropped below the session end level" name="" value="0x1" />
         <value caption="Vbus voltage has not dropped below the session end level" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Activity Indicator bit" name="U1OTGIR__ACTVIF">
         <value caption="Activity on the D+" name="" value="0x1" />
         <value caption="Activity has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U1OTGIR__LSTATEIF">
         <value caption="USB line state has been stable for 1 millisecond" name="" value="0x1" />
         <value caption="USB line state has not been stable for 1 millisecond" name="" value="0x0" />
      </value-group>
      <value-group caption="1 Millisecond Timer bit" name="U1OTGIR__T1MSECIF">
         <value caption="1 millisecond timer has expired" name="" value="0x1" />
         <value caption="1 millisecond timer has not expired" name="" value="0x0" />
      </value-group>
      <value-group caption="ID State Change Indicator bit" name="U1OTGIR__IDIF">
         <value caption="Change in ID state is detected" name="" value="0x1" />
         <value caption="No change in ID state is detected" name="" value="0x0" />
      </value-group>
      <value-group caption="A- Vbus Valid Interrupt Enable bit" name="U1OTGIE__VBUSVDIE">
         <value caption="A-Vbus valid interrupt is enabled" name="" value="0x1" />
         <value caption="A-Vbus valid interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="B-Session End Interrupt Enable bit" name="U1OTGIE__SESENDIE">
         <value caption="B-session end interrupt is enabled" name="" value="0x1" />
         <value caption="B-session end interrupt is disabled" name="" value="0x0" />
      </value-group>
